akamud.vscode-theme-onedark
amazonwebservices.aws-toolkit-vscode
arzg.eclipse
asciidoctor.asciidoctor-vscode
changkaiyan.tf2snippets
cschlosser.doxdocgen
donjayamanne.githistory
DotJoshJohnson.xml
esbenp.prettier-vscode
eserozvataf.one-dark-pro-monokai-darker
hanifmifta.adocs
jeff-hykin.better-cpp-syntax
mark-tucker.aws-cli-configure
mhutchie.git-graph
mike-lischke.vscode-antlr4
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-es
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.remote-explorer
platformio.platformio-ide
redhat.java
redhat.vscode-xml
SimonSiefke.vue-preview
sohibe.java-generate-setters-getters
tht13.python
twxs.cmake
uloco.theme-bluloco-dark
vahidk.tensorflow-snippets
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
Vue.volar
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
